{"philosopher": "Mencius", "work": "Mencius", "book": "One", "reference": "1A1", "text": "Mengzi had an audience with King Hui of Liang. The King said, “Sir, you have come, not regarding one thousand li as too far. Surely you will have something to profit my state?” Mengzi said in response, “Why must Your Majesty say ‘profit’? Let there be benevolence and righteousness and that is all. Your Majesty says, ‘How can my state be profited?’ The Counselors say, ‘How can my family be profited?’ The scholars and commoners say, ‘How can I be profited?’ Those above and those below mutually compete for profit and the state is endangered. “In a case where the ruler of a state that can field ten thousand chariots is murdered, it must be by a family that can field a thousand chariots. In a case where the ruler of a state that can field a thousand chariots is murdered, it must be by a family that can field a hundred chariots. One thousand out of ten thousand, or one hundred out of a thousand, cannot be considered to not be a lot. But if righteousness is CHAPTER FOUR put behind and profit is put ahead, one will not be satisfied without grasping from others. “There have never been those who were benevolent who abandoned their parents. There have never been those who were righteous who put their ruler last. Let Your Majesty say, ‘Benevolence and righteousness,’ and that is all. Why must you say ‘profit’?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "One", "reference": "1A3", "text": "King Hui of Liang said, “In relation to the state, We exert our heart to the utmost. When there is a famine in the region inside the river, then We move people to the region east of the river, and move grain to the region inside the river. When there is a famine in the region east of the river, We do the converse. When We examine the government of neighboring states, there is none that exerts itself as We do. Yet the people of neighboring states do not grow fewer, and Our people do not grow more numerous. How is this?” Mengzi responded, “Your Majesty is fond of war. Allow me to use an illustration from warfare: Thunderingly, the drums beat the soldiers forward; their swords have already clashed; casting aside their armor and trailing their weapons they run away. Some run a hundred paces and then stop; others run fifty paces and then stop. How would it be if those who ran fifty paces laughed at those who ran a hundred paces?” He responded, “That is unacceptable. They simply did not run a hundred paces. But what they did is running away too.” Mengzi said, “If Your Majesty understands this, then you will not expect your people to be more numerous than those of neighboring states.” . . ."}
{"philosopher": "Mencius", "work": "Mencius", "book": "One", "reference": "1A7", "text": "King Xuan of Qi asked, “May I hear from you of the actions of the Lord Protectors Huan of Qi and Wen of Jin?” Mengzi said in response, “The disciples of Kongzi did not give accounts of the actions of Huan and Wen. Because of this, they were not passed on to later generations, and I, your servant, have not heard of them. But, if you insist, then may we talk about being a genuine king?” Xuan said, “What must one’s Virtue be like so that one can become a king?” Mengzi said, “One cares for the people and becomes a king. This is something no one can stop.” Xuan said, “Can one such as I care for the people?” records of Huan and Wen. See also Mengzi 4B (below) on honesty.  Mengzi said, “He can.” Xuan said, “How do you know that I can?” Mengzi said, “I heard your attendant Hu He say, The King was sitting up in his hall. There was an ox being led past below. The King saw it and said, ‘Where is the ox going?’ Someone responded, ‘We are about to consecrate a bell with its blood.’ The King said, ‘Spare it. I cannot bear its frightened appearance, like an innocent going to the execution ground.’ Someone responded, ‘So should we abandon the consecrating of the bell?’ The King said, ‘How can that be abandoned? Exchange it for a sheep.’” Mengzi continued, “I do not know if this happened.” Xuan said, “It happened.” Mengzi said, “This feeling is sufficient to be a king. The commoners all thought Your Majesty was being stingy. But I knew that Your Majesty could not bear the frightened appearance of the ox.” The King said, “That is so. There really were commoners like that. Although Qi is a small state, how could I be stingy about one ox? It was just that I could not bear its frightened appearance, like an innocent going to the execution ground. Hence, I exchanged it for a sheep.” Mengzi said, “Let Your Majesty not be surprised at the commoners’ taking you to be stingy. You took a small thing and exchanged it for a big thing. How could they understand? If Your Majesty were pained at its being innocent and going to the execution ground, then what is there to choose between an ox and a sheep?” The King laughed and said, “What was this feeling really?! It’s not the case that I begrudged its value and exchanged it for a sheep. But it makes sense that the commoners would say I was stingy.” Mengzi said, “There is no harm. This is just the way benevolence works. You saw the ox but had not seen the sheep. As for the relation of gentlemen to birds and beasts, if they see them living, they cannot bear to see them die. If they hear their cries, they cannot bear to eat their flesh. Hence, gentlemen keep their distance from the kitchen.” The King was pleased and said, “The Odes say, Another person had the heart, But I measured it. out onto the courtyard below. See the Title Support Page for this volume at www.hackettpublishing.com /rccp-support for an image of such a hall. Cf. Zhuangzi chapter 1 (in chapter 8 of this volume). This describes you. I was the one who did it. I reflected and sought it out, but did not understand my heart. You spoke, and in my heart there was a feeling of compassion. In what way does this heart accord with being a king?” Mengzi said, “Suppose there were someone who reported to Your Majesty, saying, ‘My strength is sufficient to lift five hundred pounds, but not sufficient to lift one feather. My eyesight is sufficient to examine the tip of an autumn hair, but I cannot see a wagon of firewood.’ Would Your Majesty accept that?” Xuan said, “No.” Mengzi said, “In the present case, your kindness is sufficient to reach birds and beasts, but the benefits do not reach the commoners. Why is this case alone different? Hence, not lifting one feather is due to not using one’s strength. Not seeing a wagon of firewood is due to not using one’s eyesight. The commoners not receiving care is due to not using one’s kindness. Hence, Your Majesty’s not being a genuine king is due to not acting; it is not due to not being able.” Xuan said, “What is the difference between concrete cases of not doing and not being able?” Mengzi said, “‘Pick up Mount Tai and leap over the North Sea.’ If you say, ‘I cannot,’ this is truly not being able. ‘Massage the stiff joints of an elderly person.’ If you say, ‘I cannot,’ this is not acting; it is not a case of not being able. So, Your Majesty’s not being a king is not in the category of picking up Mount Tai and leaping over the North Sea. Your Majesty’s not being a king is in the category of massaging the stiff joints of an elderly person. “Treat your elders as elders, and extend it to the elders of others; treat your young ones as young ones, and extend it to the young ones of others; then you can turn the whole world in the palm of your hand. The Odes say, He set an example for his wife, It extended to his brothers, And so, he controlled his family and state. This means that he simply took this feeling and applied it to that. Hence, if one extends one’s kindness, it will be sufficient to care for all within the Four Seas. If one does not extend one’s kindness, one will lack the wherewithal to care for one’s wife and children. That in which the ancients greatly exceeded others was no other than this. They were simply good at extending what they did. In the present case your kindness is sufficient to reach birds and beasts, but the benefits do not  reach the commoners. Why is this case alone different? Weigh, and then you will distinguish the light and the heavy. Measure, and then you will distinguish the long and the short. Things are all like this, the heart most of all. Let Your Majesty measure it. “Perhaps Your Majesty can only be happy in his heart by rallying soldiers, endangering his scholars and ministers, and incurring the resentment of the other lords?” Xuan said, “No. How could I be happy about these things?” Mengzi said, “Could I hear Your Majesty’s greatest desire?” The King smiled and did not speak. Mengzi said, “Is it because your hearty and sweet foods are insufficient for your mouth? Are your light and warm clothes insufficient for your body? Or yet because there are insufficient beautiful and charming sights for your eyes to look at? Are there insufficient melodies for your ears to listen to? Are your servants insufficient to order about in front of you? Your Majesty’s various ministers are sufficient to serve you. Does Your Majesty actually do what you do for these things?!” Xuan said, “No. It is not for the sake of these things.” Mengzi said, “Then Your Majesty’s greatest desire can be known. You desire to govern the land, bring to your court the states of Qin and Chu, oversee the Central States, and dominate the barbarians. By means of such things as you do, to seek such things as you desire, is like climbing a tree in search of a fish.” The King said, “Is it as extreme as that?” Mengzi said, “The danger is greater than that! If one climbs a tree in search of a fish, although one will not get a fish, there will not be any disaster afterward. By means of such things as you do, to seek such things as you desire, if one exhausts the strength of one’s heart in doing it, afterward there must be disaster.” Xuan said, “Could I hear of this?” Mengzi said, “If the people of Zou and the people of Chu fought, who does Your Majesty think would win?” Xuan said, “The people of Chu would win.” Mengzi said, “So the small definitely cannot match the big, the few definitely cannot match the many, the weak definitely cannot match the strong. The region within the seas is nine thousand square li. Qi amounts to one thousand. To take on eight with one, how is this different from Zou matching Chu?! “Simply return to the fundamentals. Suppose Your Majesty were to bestow benevolence in governing. This would cause all under Heaven who serve others to want to take their place in Your Majesty’s court, all those who plow to want to plow in Your Majesty’s uncultivated fields, all merchants to want to place their goods in Your Majesty’s markets, all those who travel to wish to use Your Majesty’s roads. All CHAPTER FOUR under Heaven who wish to complain of their rulers would desire to report to Your Majesty. If it were like this, who could stop it?” The King said, “I am ignorant and unable to undertake this. But I am willing for you, Master, to redirect my resolution, enlighten, and instruct me. Although I am not clever, please let me try.” Mengzi said, “To lack a constant livelihood, yet to have a constant heart—only a scholar is capable of this. As for the people, if they lack a constant livelihood, it follows that they will lack a constant heart. And if one simply fails to have a constant heart, dissipation and evil will not be avoided. When they thereupon sink into crime, to go and punish them is to trap the people. When there are benevolent people in positions of authority, how is it possible to trap the people? For this reason, an enlightened ruler, in regulating the people’s livelihood, must ensure that it is sufficient, on the one hand, to serve one’s father and mother, and on the other hand, to nurture wife and children. In good years, one is always full. In years of famine, one escapes death. Only when the people have a regulated livelihood do they rush toward the good, and thus the people follow the ruler easily. “Nowadays, in regulating the people’s livelihood, on the one hand it is insufficient to serve one’s father and mother, on the other it is insufficient to nurture wife and children. In good years, one is always bitter. In years of famine, one cannot escape death. This is a case in which one fears not having the means to save people from death. How could one have leisure for teaching ritual and righteousness? “If Your Majesty wishes to put benevolent government into effect, then simply return to the fundamentals. Plant every household of five mu with mulberry trees, and fifty-year-olds can wear silk. Let the nurturing of chickens, pigs, and dogs not be neglected, and seventy-year-olds can eat meat. If you do not disturb the seasonal work in each field of one hundred mu, a household with eight mouths to feed need not go hungry. If you are careful about the teachings of the schools, explaining the righteousness of filial piety and fraternal respect, then those with gray hair will not be carrying loads on the roads. For the old to wear silk and eat meat, and the blackhaired people to be neither hungry nor cold, yet for their ruler not to become a king—such a thing has never happened.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "One", "reference": "1B5", "text": ". . . King Xuan of Qi said, “Your teachings are excellent!” Mengzi responded, “If Your Majesty regards them as excellent, then why do you not put them into practice?”  The King said, “We have a weakness. We are fond of wealth.” He responded, “In former times, Duke Liu was fond of wealth. The Odes say, He stacked, he stored, He bundled up dried meat and grain, In bags, in sacks, Thinking to gather together and bring glory. His bows and arrows were displayed, With shields, spears, and battle-axes, He commenced his march. Hence, those who stayed at home had loaded granaries, and those who marched had full provisions. Only then could he ‘commence his march.’ If Your Majesty is fond of wealth but allows the common folk to possess wealth, what difficulty is there in being a genuine king?” The King responded, “We have a weakness. We are fond of sex.” Mengzi responded, “In former times, King Tai was fond of sex, and loved his wife. The Odes say, The Ancient Duke Danfu Came in the morning, riding his horse, Following the banks of the Western waters, He came to the foot of Mount Qi, With his Lady Jiang. They came and both settled there. At that time, there were no dissatisfied women in private, or any unmarried men in public. If Your Majesty is fond of sex but accords the common folk the same privileges, what difficulty is there in being a genuine king?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "One", "reference": "1B6", "text": "Mengzi spoke to King Xuan of Qi, saying, “If, among Your Majesty’s ministers, there were one who entrusted his wife and children to his friend, and traveled to the state of Chu, and when he returned, he discovered that his friend had let his wife and children become cold and hungry—how should one deal with this?” The King said, “Abandon him.” Mengzi said, “If the sergeant-at-arms is not able to keep order among the scholars, how should one deal with this?” considered paradigms of virtuous rulers. The King said, “Discharge him.” Mengzi said, “If the region within the four borders is not well-ordered, then how should one deal with this?” The King turned toward his attendants and changed the topic."}
{"philosopher": "Mencius", "work": "Mencius", "book": "Two", "reference": "1B8", "text": "King Xuan of Qi asked, “Is it the case that Tang banished Tyrant Jie, and that Wu struck down Tyrant Zhou?” Mengzi responded, saying, “There are such accounts in the historical records.” The King said, “Is it acceptable for subjects to kill their rulers?” Mengzi said, “One who violates benevolence should be called a ‘thief.’ One who violates righteousness is called a ‘mutilator.’ A mutilator and thief is called a mere ‘fellow.’ I have heard of the execution of a mere fellow ‘Zhou,’ but I have not heard of the killing of one’s ruler.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Two", "reference": "2A2", "text": "Gongsun Chou asked, “Suppose that you, Master, were to be appointed to the position of high noble or prime minister in Qi and were able to put the Way into practice there. If it were so, it would not be surprising at all if the ruler of Qi were to become a lord protector or a genuine king. If it were like this, would it perturb your heart or not?” Mengzi said, “It would not. My heart has been unperturbed since I was forty.” Gongsun Chou said, “In that case, you, Master, have far surpassed Meng Ben.” Mengzi said, “This is not difficult. Gaozi had an unperturbed heart before I.” Gongsun Chou said, “Is there a way of cultivating an unperturbed heart?” Mengzi said, “There is. As for Bogong You’s cultivation of courage, his body would not shrink, his eyes would not blink. He regarded the least slight from someone like being beaten in the marketplace. Insults he would not tolerate from a common fellow coarsely clad he also would not tolerate from a ruler who could field serpents, and, when traveling by land, did not avoid rhinoceroses and tigers.” Mengzi’s critique of Gaozi, see David S. Nivison, “Philosophical Voluntarism in Fourth-Century China,” in The Ways of Confucianism (Chicago: Open Court Publishing, 1), 1–. For a discussion of the different accounts of courage presented in this passage, see Bryan W. Van Norden, “Mengzi on Courage,” in The Philosophy of Religion, edited by Peter A. French, Theodore E. Uehling, and Howard K. Wettstein, Midwest Studies in Philosophy, vol. 2 (Notre Dame, IN: University of Notre Dame Press, 1), 2–.  ten thousand chariots. He looked upon running a sword through a ruler who could field ten thousand chariots as like running through a common fellow. He did not treat the various lords with deference. If an insult came his way, he had to return it. “As for Meng Shishe’s cultivation of courage, he said, ‘I look upon defeat the same as victory. To advance only after sizing up one’s enemy, to ponder whether one will achieve victory and only then join battle, this is to be in awe of the opposing armies. How can I be certain of victory? I can only be without fear.’ “Meng Shishe resembled Master Zeng. Bogong You resembled Zixia. Now, as for the courage of the two, I do not really know which was better. Nonetheless, Meng Shishe preserved something important. “Formerly, Master Zeng speaking to Zixiang said, ‘Are you fond of courage? I once heard about great courage from the Master: If I examine myself and am not upright, although I am opposed by a common fellow coarsely clad, would I not be in fear? If I examine myself and am upright, although I am opposed by thousands and tens of thousands, I shall go forward.’ Meng Shishe’s preservation of his qi was still not as good as Master Zeng’s preservation of what is important.” Gongsun Chou said, “I venture to ask whether I could hear about your unperturbed heart, Master, and Gaozi’s unperturbed heart?” Mengzi answered, “Gaozi said, ‘What you do not get from doctrines, do not seek for in your heart. What you do not get from your heart, do not seek for in the qi.’ ‘What you do not get from your heart, do not seek for in the qi,’ is acceptable. ‘What you do not get from doctrines, do not seek for in your heart,’ is unacceptable. “Your resolution is the commander of the qi. Qi is that which fills up the body. When your resolution is fixed somewhere, the qi sets up camp there. Hence, it is said, ‘Maintain your resolution. Do not injure the qi.’” Gongsun Chou asked, “Since you have already said, ‘When your resolution is fixed somewhere, the qi sets up camp there,’ why do you add, ‘Maintain your resolution. Do not injure the qi’?” it may also be Master Zeng paraphrasing the Master’s teaching. our ethical inclinations (Mengzi 2A and 6A). The “resolution” (zhì 志) is not a separate faculty, but is simply the heart directed toward a certain goal or object. Contrast what Zhuangzi suggests about the relationship between what one hears, one’s heart, and the qi in Zhuangzi chapter 4, “The Human Realm” (in chapter 8 of this volume). On qi, see Important Terms in the appendices. CHAPTER FOUR Mengzi said, “When your resolution is unified it moves the qi. When the qi is unified it moves your resolution. Now, stumbling and running have to do with the qi, but nonetheless they perturb one’s heart.” Gongsun Chou said, “I venture to ask wherein you excel, Master.” Mengzi said, “I understand words. I am good at cultivating my floodlike qi.” Gongsun Chou said, “I venture to ask what is meant by ‘floodlike qi.’” Mengzi said, “It is difficult to put into words. It is a qi that is supremely great and supremely unyielding. If one cultivates it with uprightness and does not harm it, it will fill up the space between Heaven and earth. It is a qi that unites righteousness with the Way. Without these, it starves. It is produced by accumulated righteousness. It cannot be obtained by a seizure of righteousness. If some of one’s actions leave one’s heart unsatisfied, it will starve. Consequently, I say that Gaozi never understood righteousness, because he regarded it as external. “One must work at it, but do not aim at it directly. Let the heart not forget, but do not ‘help’ it grow. Do not be like the man from Song. Among the people of the state of Song there was one who, concerned lest his seedlings not grow, pulled on them. Wearily, he returned home, and said to his family, ‘Today I am worn out. I helped the seedlings to grow.’ His son rushed out and looked at it. The seedlings were withered. Those in the world who do not ‘help’ their seedlings to grow are few. Those who abandon them, thinking it will not help, are those who do not weed their seedlings. Those who ‘help’ them grow are those who pull on the seedlings. Not only does this not help, but it even harms them.” Gongsun Chou said, “What is meant by ‘understanding words’?” Mengzi said, “If someone’s expressions are one-sided, I know that by which they are deluded. If someone’s expressions are excessive, I know that by which they are entangled. If someone’s expressions are heretical, I know that by which they are separated from the Way. If someone’s expressions are evasive, I know that by which they are exhausted. When these states grow in the heart, they are harmful in governing. When they are manifested in governing, they are harmful in one’s activities. When sages arise again, they will surely follow what I have said.” Han Feizi chapter 4 (in chapter 1 of this volume). lects 1. (in chapter 1 of this volume), and is a central notion in Xunzi chapter 2, “Undoing Fixation” (in chapter 9 of this volume).MENGZI (MENCIUS)  Gongsun Chou said, “Zai Wo and Zigong were good at rhetoric. Ran Niu, Minzi, and Yan Yuan were good at discussing virtuous actions. Kongzi combined all these excellences, but said, ‘When it comes to rhetoric, I am incapable.’ In that case, are you, Master, already a sage?!” Mengzi said, “Oh, what kind of talk is that?! Long ago, Zigong asked Kongzi, ‘Are you, Master, really a sage?’ Kongzi replied, ‘As for being a sage, I am incapable of that. I study without tiring and teach without wearying.’ Zigong said, ‘To study without tiring is wisdom; to teach without wearying is benevolence. Being benevolent and wise, the Master is certainly already a sage!’ So, to be a sage is not something Kongzi was comfortable with. So how could you ask me that?!” Gongsun Chou said, “Formerly, I heard the following: Zigong, Ziyou, and Zizhang all had one aspect of a sage. Ran Niu, Minzi, and Yan Yuan had all aspects of a sage, but in miniature. I venture to ask in which group you would be comfortable?” Mengzi said, “Leave this topic for now.” Gongsun Chou said, “What about Bo Yi and Yi Yin?” Mengzi said, “Their Ways were different. If he was not his ruler, he would not serve him; if they were not his subjects, he would not direct them; if things were orderly, he would advance; if they were chaotic, he would retreat. This was Bo Yi. Whom do I serve who is not my ruler? Whom do I direct who are not my subjects? If things were orderly, he would advance, and if they were chaotic, he would also advance. This was Yi Yin. When one should take office, he would take office; when one should stop, he would stop; when one should take a long time, he would take a long time; when one should hurry, he would hurry. This was Kongzi. All were sages of ancient times. I have never been able to act like them, but my wish is to learn from Kongzi.” Gongsun Chou asked, “Were Bo Yi and Yi Yin at the same level as Kongzi?” Mengzi said, “No. Since humans were first born there has never been another Kongzi.” Gongsun Chou said, “In that case, were there any similarities?” Mengzi said, “There were. If any became ruler of a territory of a hundred li, he would be able to possess all under Heaven by bringing the various lords to his court. And if any could obtain all under Heaven by performing one unrighteous deed, or killing one innocent person, he would not do it. In these things they are the same.” Gongsun Chou asked, “I venture to ask wherein they differed?” Mengzi said, “Zai Wo, Zigong, and You Ruo had wisdom sufficient to recognize a sage. Even if they exaggerated, they would not have done so to the extent of flattering someone they were fond of. Zai Wo said, ‘In my view of Kongzi, he is far more noble than Yao and Shun!’ Zigong said, ‘He sees their rituals and appreciates their government; he hears their music and appreciates their Virtue; from a hundred generations later, through the succession of a hundred kings, nothing gets away from him. Since humans were first born, there has never been another like the Master.’ You Ruo said, ‘Is it only true of people? The unicorn among beasts, the phoenix among birds, Mount Tai among hills, and rivers and seas among flowing waters, are all of a kind. The sage among people is also of the same kind. Some stand out from this kind; some stick up from the row; since humans were first born, there has never been one who stands out more than Kongzi.’”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Two", "reference": "2A6", "text": "Mengzi said, “Humans all have hearts that are not unfeeling toward others. The former kings had hearts that were not unfeeling toward others, so they had governments that were not unfeeling toward others. If one puts into practice a government that is not unfeeling toward others by means of a heart that is not unfeeling toward others, bringing order to the whole world is in the palm of your hand. “The reason why I say that humans all have hearts that are not unfeeling toward others is this. Suppose someone suddenly saw a child about to fall into a well: everyone in such a situation would have a feeling of alarm and compassion—not because one sought to get in good with the child’s parents, not because one wanted fame among their neighbors and friends, and not because one would dislike the sound of the child’s cries. “From this we can see that if one is without the heart of compassion, one is not a human. If one is without the heart of disdain, one is not a human. If one is without the heart of deference, one is not a human. If one is without the heart of approval and disapproval, one is not a human. The heart of compassion is the sprout of benevolence. The heart of disdain is the sprout of righteousness. The heart of deference is the sprout of propriety. The heart of approval and disapproval is the sprout of wisdom. meaning of these terms is “right” and “wrong” but in this context Mengzi intends not only knowledge but approval of what is right and disapproval of what is wrong. lence,” see Mengzi 1A. For more on yì 義, “righteousness,” see Mengzi 6A. For more on zhì 智, “wisdom,” see Mengzi 5A. On Mengzi’s general view of self-cultivation, see Mengzi 7A and 7B. “Propriety” here is lǐ 禮, the character for “ritual” elsewhere. Mengzi is suggesting that an inclination toward ritual activity is innate in us. See Mengzi 3A for a possible illustration of this.MENGZI (MENCIUS)  “People having these four sprouts is like their having four limbs. To have these four sprouts but to say of oneself that one is unable to be virtuous is to steal from oneself. To say that one’s ruler is unable to be virtuous is to steal from one’s ruler. In general, having these four sprouts within oneself, if one knows to fill them all out, it will be like a fire starting up, a spring breaking through! If one can merely fill them out, they will be sufficient to care for all within the Four Seas. If one merely fails to fill them out, they will be insufficient to serve one’s parents.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Three", "reference": "2B13", "text": "Mengzi left the state of Qi. While on the road, Chongyu asked, “It seems that you, Master, have an unhappy countenance. The other day, I heard it from you, Master, that [Kongzi said], ‘The gentleman does not resent Heaven for his troubles, nor does he cast aspersions upon other people.’” Mengzi said, “That time [in which Kongzi spoke] is the same as this time. Every five hundred years, there must arise a sage-king. Between them, there must be those whose names are known to a generation for their accomplishments. From the founding of the Zhou dynasty, it has already been more than seven hundred years. Numerically, this is excessive. And if one examines it in terms of the conditions of the world, then it is possible that a new sage-king will arise. Now, Heaven does not yet desire to pacify the world. If it desired to pacify the world, who besides me in the present time is there to help do it? Why would I be unhappy?!”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Three", "reference": "3A3", "text": ". . . Mengzi said, “The well-field system takes a one-li-square piece of land, amounting to 9 mu.  At its center is the public field. Eight families each keep privately 1 mu, and jointly cultivate the public field. Only after the public work is completed do they dare do their private work. This is the distinctive role of the rural people.” . . . ernment” policies he advocated had failed. See Mengzi 1A, 1B, 1B, and 1B (all found in this chapter). Interpretation of Mencius 2B.,” Early China 1 (January 1): 1–. equal fields. The boundaries between these regions would then look something like this: 井. Pronounced jǐng, this happens to be the character for “well” in Chinese, hence the expression “well-field.” CHAPTER FOUR"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Three", "reference": "3A4", "text": "There was a certain Xu Xing who, on account of the doctrines of Shen Nong, went from the state of Chu to Teng, and, going in person to his gate, told Duke Wen, “People from distant parts have heard that you, My Lord, practice benevolent government. I wish to receive a homestead and become one of your subjects.” Duke Wen gave him a place. His followers were a few dozen people, all of whom wore coarse clothing and made sandals and mats for a living. Chen Liang’s disciple Chen Xiang and his younger brother Xin carried their plows on their backs and went from Song to Teng, saying, “We have heard that you, My Lord, practice the government of a sage. This is to be a sage. I wish to become the subject of a sage.” Chen Xiang met Xu Xing and was delighted. He completely abandoned his former studies and studied with him instead. Chen Xiang met Mengzi and discoursed on the doctrines of Xu Xing, saying, “The ruler of Teng is truly a worthy ruler. Nonetheless, he has not yet heard the Way. The worthy plow with their subjects and then eat, eating breakfast and dinner with them and then governing. In the present case, Teng has granaries and treasuries; this is to harm the people in order to nurture oneself. How can this be worthy?” Mengzi said, “Xuzi must plant his grain first and only then eat?” Chen said, “That is so.” Mengzi said, “Xuzi must weave his cloth and only then wear clothes?” Chen said, “No. Xuzi wears hemp.” Mengzi said, “Does Xuzi wear a cap?” Chen said, “He does.” Mengzi said, “What sort does he wear?” Chen said, “He wears plain silk.” Mengzi said, “Does he weave it himself?” Chen said, “No. He exchanges millet for it.” Mengzi said, “Why does Xuzi not weave it himself?” Chen said, “That would interfere with farming.” Mengzi said, “Does Xuzi use clay pots for cooking, and an iron plow?” Chen said, “That is so.” Mengzi said, “Does he make them himself?” Chen said, “No. He exchanges millet for them.” Mengzi said, “Exchanging millet for tools does not harm the blacksmith. And when the blacksmith exchanges tools for millet, does this really hurt the farmer?! Why does Xuzi not become a blacksmith, and only get everything from his own in the appendices.MENGZI (MENCIUS)  household to use? Why does he exchange things in such confusion with the various artisans? Why does Xuzi not avoid all this trouble?” Chen said, “The activities of the various artisans inherently cannot be done along with farming.” Mengzi said, “In that case, can governing the world alone be done along with farming? There are the affairs of great people, and the affairs of lesser people. Furthermore, the products of the various artisans are available to each person. If one can make use of them only after one has made them oneself, this will lead the whole world to exhaustion. Hence it is said, ‘Some labor with their hearts; some labor with their physical strength.’ Those who labor with their hearts govern others; those who labor with their physical strength are governed by others. Those who are governed by others feed those others; those who govern others are fed by those others. This is righteousness throughout the world. . . . “It is the way of people that if they are full of food, have warm clothes, and live in comfort, but are without instruction, then they come close to being animals. Sage-king Shun was anxious about this too, so he instructed Xie to be Minister of Instruction, and instruct them about human relations: the relation of father and children is one of love, ruler and minister is one of righteousness, husband and wife is one of distinction, elder and younger is one of precedence, and that between friends is one of trust. Yao said, ‘Encourage them, draw them forward, straighten them, rectify them, help them, make them practice, assist them, make them get it themselves, and then benefit them.’ Since the sage’s anxiousness for his subjects was like this, could he have the free time to farm?” . . . [Chen said,] “If we follow the Way of Xuzi, market prices will never vary, and there will be no artifice in the state. Even if one sends a child to go to the market, no one will cheat him. Cotton cloth or silk cloth of the same length will be of equal price. Bundles of hemp or silk of the same weight will be of equal price. The same amount of any of the five grains will be the same price. Shoes of the same size will be of equal price.” Mengzi said, “It is the essence of things to be unequal. One thing is twice or five times more than another, another ten or a hundred times more, another a thousand or ten thousand times more. If you line them up and identify them, this will bring chaos to the world. If a great shoe and a shoddy shoe are the same price, achievements of the sage-rulers of old in making civilization possible. chapter 8 of this volume). CHAPTER FOUR will anyone make the former? If we follow the Way of Xuzi, we will lead each other into artifice. How can this bring order to the state?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Three", "reference": "3A5", "text": "The Mohist Yi Zhi sought to see Mengzi through the help of Xu Bi. Mengzi said, “I am definitely willing to see him, but today I am still ill. When my illness improves, I will go and see him. Yi Zhi does not have to come.” The next day, he again sought to see Mengzi. Mengzi said, “Today I [still] can [not] see him. [But] if one is not upright, the Way will not be manifest. I will make him upright. “I have heard that Yi Zhi is a Mohist. Mohists, in regulating mourning, take frugality as their Way. Yi Zhi longs to change the world to the Mohist Way. Surely, he honors the Mohist practice because he regards it as right? Nonetheless, Yi Zhi buried his parents lavishly, so he served his parents by means of what he demeans.” Xu Bi told Yi Zhi this. Yi Zhi said, “As for the Way of the Confucians, the ancients tended the people ‘like caring for children.’ What does this saying mean? I take it to mean that love is without distinctions, but it is bestowed beginning with one’s parents.” Xu Bi told Mengzi this. Mengzi said, “Does Yi Zhi truly hold that one’s affection for one’s elder brother’s son is like one’s affection for one’s neighbor’s child? There is only one thing to be gleaned from that saying: when a crawling child is about to fall into a well, it is not the child’s fault. Furthermore, Heaven, in producing the things in the world, causes them to have one source, but Yi Zhi gives them two sources. “Now, in past ages, there were those who did not bury their parents. When their parents died, they took them and abandoned them in a ditch. The next day they passed by them, and foxes were eating them, bugs were sucking on them. Sweat broke out on the survivors’ foreheads. They turned away and did not look. Now, it was not for the sake of others that they sweated. What was inside their hearts broke through to their countenances. So, they went home and, returning (presumably because Mengzi is ill). Cf. Analects 1. (in chapter 1 of this volume). (Oxford: Clarendon Press, 1; Taibei: SMC Publishing, 1), 3. Open Court Press, 1], 1–) that the two sources (běn 本, literally “roots”) Yi Zhi accepts are () our innate sense of benevolence, which is first directed toward our parents (cf. Mengzi 7A), and () a doctrine of universalization that instructs us to extend this innate feeling so that it applies to everyone equally.MENGZI (MENCIUS)  with baskets and shovels, covered them. If covering them was really right, then when filial children and benevolent people cover their parents, it must also be part of the Way.” Xu Bi told Yi Zhi this. Yi Zhi looked thoughtful for a moment and said, “He has taught me.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Three", "reference": "3B2", "text": ". . . Mengzi said, “When a daughter marries, her mother instructs her. Sending her off at the gate, she cautions her, saying, ‘When you go to your family, you must be respectful, and you must be cautious. Do not disobey your husband.’ To regard obedience as proper is the Way of a wife or concubine.” . . ."}
{"philosopher": "Mencius", "work": "Mencius", "book": "Three", "reference": "3B9", "text": "Gongduzi said, “Outsiders all say that you are fond of disputation, Master. I venture to ask why?” Mengzi said, “How could I be fond of disputation? I simply have no choice. The people of the world were born long ago, and have alternated between being orderly and chaotic. In the time of Yao, the waters overflowed their courses, inundating the central states. Serpents occupied the land, and the people were unsettled. In low-lying regions, they made nests in trees. On the high ground, they lived in caves. The History says, ‘The deluge warned us.’ ‘The deluge’ refers to the flooding water. Yu was directed to regulate the waters. Yu dredged out the earth and guided the water into the sea, chasing the reptiles into the marshes. The waters flowed out through the channels, and these became the Jiang, Huai, He, and Han rivers. The dangers to people having been eliminated, birds and beasts harmful to humans were destroyed, and only then were humans able to live on the plains. “After Yao and Shun passed away, the Way of the sages decayed. Cruel rulers arose one after another, destroying homes to make ponds, so that the people had nowhere they could rest. They made people abandon the fields so that they could be made into parks, so that the people could not get clothes and food. Evil doctrines and cruel practices also arose. As parks, ponds, and marshes became more numerous, the birds and beasts returned. By the time of Tyrant Zhou, the world was again in great disorder. The Duke of Zhou assisted King Wu in punishing Tyrant Zhou; he attacked the state of Yan, and after three years executed its ruler; he under Important Texts in the appendices. On Yao, Shun, Yu and the other figures mentioned in this and the following paragraph, see under Important Figures in the appendices. and not for the benefit of the people. CHAPTER FOUR drove Feilian to a corner by the sea and terminated him; he eliminated fifty states; he drove tigers, leopards, rhinoceroses, and elephants far off, and the whole world rejoiced. The History says, ‘Splendid indeed were the plans of King Wen! Great indeed were the achievements of King Wu! They assist and instruct us descendants. In all things they are correct, and lack nothing.’ “With the decay of the Way, evil doctrines and cruel actions again arose. Ministers murdering their rulers—this happened. Sons murdering their fathers—this happened. Kongzi was afraid, and composed the Spring and Autumn Annals. The Spring and Autumn Annals is the activity of the Son of Heaven. For this reason, Kongzi said, ‘Those who appreciate me, will it not be because of the Spring and Autumn Annals? Those who blame me, will it not be because of the Spring and Autumn Annals?’ “Once again, a sage-king has not arisen; the various lords are dissipated; pundits engage in contrary wrangling; the doctrines of Yang Zhu and Mozi fill the world. If a doctrine does not lean toward Yang, then it leans toward Mo. Yang is ‘for ourselves.’ This is to not have a ruler. Mo is ‘impartial caring.’ This is to not have a father. To not have a father and to not have a ruler is to be an animal. Gongming Yi said, ‘In your kitchens there is fat meat, and in your stables there are fat horses. Your people look gaunt, and in the wilds are the bodies of those dead of starvation. This is to lead animals to devour people.’ “If the Ways of Yang and Mo do not cease, and the Way of Kongzi is not made evident, then evil doctrines will dupe the people, and obstruct benevolence and righteousness. If benevolence and righteousness are obstructed, that leads animals to devour people. I am afraid that people will begin to devour one another! If we defend the Way of the former sages, fend off Yang Zhu and Mozi, and get rid of specious words, then evil doctrines will be unable to arise. If they arise in one’s heart, they are harmful in one’s activities. If they arise in one’s activities, they are harmful in governing. When sages arise again, they will certainly not differ with what I have said. “Formerly, Yu suppressed the flood, and the world was settled. The Duke of Zhou incorporated the barbarians, drove away ferocious animals, and the common people were at peace. Kongzi completed the Spring and Autumn Annals, and disorderly ministers and brutal sons were afraid. The Odes say, of the activities of the ruler, or that composing it is the prerogative of the ruler. volume). On the philosophy of Yang Zhu, see Mengzi 7A and “Robber Zhi” (in chapter 3 of this volume).MENGZI (MENCIUS)  The barbarians of the west and north, these he chastised. Jing and Shu, these he punished. Thus no one dared to take us on. Those who [act as if they] have no father and no ruler, these the Duke of Zhou chastised. I, too, desire to rectify people’s hearts, to bring to an end evil doctrines, to fend off bad conduct, to get rid of specious words, so as to carry on the work of these three sages. How could I be fond of disputation? I simply have no choice. Anyone who can with words fend off Yang Zhu and Mozi is a disciple of the sages.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "3B10", "text": "Kuang Zhang said, “Wasn’t Cheng Zhongzi an incorruptible scholar?! While living in Wuling, he did not eat for three days, until his ears did not hear, and his eyes did not see. Above a well there was a plum tree whose fruit had been half-eaten by worms. Crawling, he went over to eat from it, and only after three bites could his ears hear and his eyes see.” Mengzi said, “Among the scholars of the state of Qi, Zhongzi stands out like a thumb among the fingers. Nonetheless, how could Zhongzi be incorruptible? To fill out what Zhongzi attempts, one would have to be an earthworm. Now, an earthworm eats dry earth above and drinks muddy water below. The house in which Zhongzi lives, was it built by Bo Yi, or was it in fact built by Robber Zhi? Was the millet that he eats planted by Bo Yi, or was it in fact planted by Robber Zhi? This cannot be known.” Kuang said, “Why is that a problem? He himself weaves sandals of hemp, his wife spinning the hemp, in exchange for these other things.” Mengzi said, “Zhongzi comes from a great family of Qi. His elder brother Dai received a salary of ten thousand bushels of grain from estates at Ge. He regarded his brother’s salary as an unrighteous salary, and would not live off of it. He regarded his brothers’ dwelling as an unrighteous dwelling, and would not live in it. He left his elder brother, distancing himself from his mother, and lived in Wuling. On a later day, he visited home, and someone had given a live goose to his elder brother as a gift. He knitted his brow and said, ‘What will you use this cackling thing for?!’ After that, his mother killed the goose, and gave it to him to eat. His elder brother came home and said, ‘This is the meat of that “cackling thing.”’ Zhongzi went out and threw it up. If it comes from his mother, he doesn’t eat it, but if it comes from Province. his wife, then he eats it. If it’s his elder brother’s dwelling, then he won’t live in it; if it’s in Wuling, then he lives in it. Is this really being able to fill out the category of action that he considers righteous?! Someone like Zhongzi must be an earthworm in order to fill out what he attempts.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4A10", "text": "Mengzi said, “One cannot have a discussion with those who are destroying themselves. One cannot act with those who throw themselves away. Those whose words are opposed to propriety and righteousness are who I mean by ‘those who are destroying themselves.’ Those who say, ‘I myself am unable to dwell in benevolence and follow righteousness’ are who I mean by ‘those who throw themselves away.’ Benevolence is people’s peaceful abode. Righteousness is people’s proper path. For one to vacate one’s peaceful abode and not dwell in it, or for one to set aside one’s proper path and not follow it—how sad!”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4A11", "text": "Mengzi said, “The Way lies in what is near, but people seek it in what is distant; one’s task lies in what is easy, but people seek it in what is difficult. If everyone would treat their kin as kin, and their elders as elders, the world would be at peace.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4A15", "text": "Mengzi said, “Of what is present within a person, nothing is more ingenuous than the pupils of the eyes. The pupils cannot hide one’s evil. If, in one’s bosom, one is upright, the pupils will be bright. If, in one’s bosom, one is not upright, the pupils will be shady. If one listens to people’s words and looks at their pupils, how can they hide?!”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4A17", "text": "Chunyu Kun said, “That men and women should not touch in handing something to one another—is this the ritual?” Mengzi said, “It is the ritual.” Chunyu Kun said, “If your sister-in-law were drowning, would you pull her out with your hand?” Mengzi said, “To not pull your sister-in-law out when she is drowning is to be a beast. That men and women should not touch in handing something to one another is the ritual, but if your sister-in-law is drowning, to pull her out with your hand is discretion.” Chunyu Kun said, “Currently, the world is drowning! Why is it that you, sir, do not pull it out?”  Mengzi said, “When the world is drowning, one pulls it out with the Way; when one’s sister-in-law is drowning, one pulls her out with one’s hand. Do you want me to save the world with a pull of my hand?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4A27", "text": "Mengzi said, “The core of benevolence is serving one’s parents. The core of righteousness is obeying one’s elder brother. The core of wisdom is knowing these two and not abandoning them. The core of ritual is to regulate and adorn these two. The core of music is to delight in these two. “If one delights in them then they grow. If they grow then how can they be stopped? If they cannot be stopped, then without realizing it one’s feet begin to step in time to them and one’s hands dance according to their rhythms.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B2", "text": "When Zichan was in charge of the government of the state of Zheng, he used his own carriage to carry people across the Zhen and the Wei rivers. Mengzi said, “He was kind, but did not understand how to govern. By September, the foot bridges are to be repaired, and by October, the carriage bridges are to be repaired, so the people no longer face the difficulty of wading across the rivers. If gentlemen are equitable in governing, it is acceptable even to order people out of their way while they travel. How can they carry every single person across? Hence, there will simply not be enough days if, in governing, one tries to make everyone happy.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B6", "text": "Mengzi said, “The propriety that is not propriety, the righteousness that is not righteousness—the great person will not practice these.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B8", "text": "Mengzi said, “People must have some things that they do not do, and only then can they really do anything.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B11", "text": "Mengzi said, “As for great people, their words do not have to be trustworthy, and their actions do not have to bear fruit. They rest only in righteousness.” bridges are damaged each year by the heavy rains in the spring and summer. Consequently, they must be repaired in the autumn. mentator Zhao Qi refers to Analects 1. (in chapter 1 of this volume) in which upright “sons cover up for their fathers.” Compare also Mengzi 1A, above, note 1, and Analects 1. (in chapter 1 of this volume). CHAPTER FOUR"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B12", "text": "Mengzi said, “Great people are those who do not lose the hearts of their ‘children.’”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B18", "text": "Xuzi said, “Kongzi several times spoke of water, saying, ‘Ah water! Ah water!’ What did he find so worthy about water?” Mengzi said, “It gushes from the spring, not letting up day or night, only advancing after filling up the hollows, and going on to the Four Seas. Things that have a source are like this. It was simply this that he found so worthy. If it merely fails to have a source, the rain collects during the spring months, and the drainage ditches are all full. However, you can just stand and wait and it will become dry. Hence, gentlemen are ashamed to have their reputation exceed what they genuinely are.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B19", "text": "Mengzi said, “That by which humans differ from birds and beasts is slight. The people abandon it. The gentleman preserves it. The sage-king Shun was insightful about things. He was perceptive about human relationships. He acted out of benevolence and righteousness. He did not act out benevolence and righteousness.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B24", "text": ". . . Mengzi said, “The people of the state of Zheng sent Zizhuo Ruzi to invade the state of Wei. Wei sent Si of Yugong to pursue him. Zizhuo Ruzi said, ‘Today my illness is acting up. I am unable to hold my bow. I suppose I shall die.’ He asked his chariot driver, ‘Who is it that chases me?’ His driver said, ‘It is Si of Yugong.’ He said, ‘I shall live!’ His driver said, ‘Si of Yugong is the best archer of the state of Wei. What do you mean, Master, when you say, “I shall live”?’ He said, ‘Si of Yugong studied archery under Tuo of Yingong. Tuo of Yingong studied archery under me. Now, Tuo of Yingong is an upright person. Those whom he chooses for friends must be upright.’ “Si of Yugong arrived and said, ‘Why do you not hold your bow, Master?’ He said, ‘Today my illness is acting up. I am unable to hold my bow.’ He replied, ‘I, petty person that I am, studied archery under Tuo of Yingong. Tuo of Yingong studied archery under you, Master. I cannot bear to take your Way and turn it against you, Master. Nonetheless, what I do today is my ruler’s business. I dare not cast it aside.’ He pulled out some arrows and hit them against the wheel of his chariot, breaking off their tips. He then shot off a set of four arrows and only then returned.” “children” is a metaphor for the ruler’s subjects. (Cf. 3A, in which Mengzi says that good rulers treat their subjects like “children,” using the same term as in this passage.) However, many interpreters follow the reading of the Song dynasty commentator Zhu Xi: “Great people are those who do not lose their heart of a child,” where “heart of a child” refers to one’s innate good nature."}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B28", "text": "Mengzi said, “That by means of which gentlemen differ from others is that they preserve their hearts. Gentlemen preserve their hearts through benevolence and through propriety. The benevolent love others, and those who have propriety respect others. Those who love others are generally loved by others. Those who respect others are generally respected by others. “Here is a person who is harsh to me. A gentleman in this situation will invariably examine himself, saying, ‘I must not be benevolent. I must be lacking in propriety. How else could this situation have come upon me?!’ If he examines himself and is benevolent, and if he examines himself and has propriety, yet the other person is still harsh, a gentleman will invariably examine himself, saying, ‘I must not be loyal.’ If he examines himself and is loyal, yet the other person is still harsh, a gentleman says, ‘This person is simply incorrigible! What difference is there between a person like this and an animal?! What point is there in rebuking an animal?’” . . ."}
{"philosopher": "Mencius", "work": "Mencius", "book": "Four", "reference": "4B29", "text": "Yu and Houji were in a peaceful era, yet they were so busy governing that they passed the doors of their homes three times without entering. Kongzi deemed them worthy. Yan Hui was in a chaotic era, lived in a narrow alleyway, subsisting upon meager bits of rice and water—other people could not have borne such hardship, and yet it never spoiled Yan Hui’s joy. Kongzi deemed him worthy. Mengzi said, “Yu, Houji, and Yan Hui had the same Way. Yu thought that, if there were anyone in the world who drowned, it was as if he had drowned them himself. Houji thought that, if there were anyone in the world who was starving, it was as if he had starved them himself. Hence, their urgency was like this. If Yu, Houji, and Yan Hui had exchanged places, they all would have done as the others. “Now, suppose there is someone from your household involved in an altercation outside. It is acceptable to go and help even though you are disheveled and not fully dressed. But if there is someone from your village involved in an altercation outside, it is foolish to go and help when you are disheveled and not fully dressed. Even bolting your door is acceptable in this case.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Five", "reference": "4B33", "text": "There was a man of the state of Qi who lived in a home with his wife and concubine. When the husband went out, he would always return full of wine and meat. His wife asked whom he ate with, and they were those of the highest wealth and rank. His wife told his concubine, “When our husband goes out, he always returns full of wine and meat. When I ask whom he ate with, it is always those of the highest wealth and rank. Yet no one noteworthy ever comes here. I shall go and spy on where our husband goes.” Figures in the appendices. CHAPTER FOUR Arising early, she discreetly followed where her husband went. Throughout the city, there was no one who stopped to chat with him. In the end, he approached those performing sacrifices among the graves beyond the East Wall of the city, and begged for their leftovers. If this was not enough, he would then look around and approach others. This was his way of getting his fill. His wife returned home and told his concubine, saying, “A husband is someone whom we look toward till the ends of our lives. And he’s like this!” And with the concubine she cursed her husband, and they cried together in the middle of the courtyard. But their husband did not know this, and came happily home, strutting before his wife and concubine. From the perspective of a gentleman, it is rare indeed that the means by which people seek wealth, rank, profit, and success would not make their wives and concubines cry together in shame!"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Five", "reference": "5A2", "text": "Wan Zhang asked, “The Odes say, How should one proceed in taking a wife? One must inform one’s parents. If this saying is trustworthy, it seems that no one would follow it more than the sage Shun. How is it that Shun took a wife without informing them?” Mengzi said, “If he had informed them, he would have been unable to take a wife. For a man and a woman to dwell together in one home is the greatest of human relations. If he had informed them, he would be abandoning the greatest of human relations, which would have caused resentment toward his parents. Because of this he did not inform them.” Wan Zhang said, “I have now received your instruction regarding Shun’s taking a wife without informing his parents. But how is it that the Emperor gave his daughter to Shun as a wife and did not inform them?” Mengzi said, “The Emperor knew too that if he informed them, he would not be able to give his daughter to him as a wife.” Wan Zhang said, “His parents made Shun repair the grain silo, and then they took the ladder away and his father set fire to the silo, but Shun escaped. Then they this passage suggests that women, too, have the sprouts or hearts of virtue (see Mengzi 2A). On the ethical status of women, see also Mengzi 3B.  made him dig a well. He left the well, but, not knowing this, they covered up the well. His brother Xiang said, ‘The credit for the plot to kill this ruler is all mine! His oxen and sheep, his granaries and silos shall be my parents’, but his spear and shield, his lute, and his bow are mine! And I shall make my two sisters-in-law service me in bed!’ So, Xiang went into Shun’s room, but Shun was on his bed playing his zither. Xiang, looking embarrassed, said, ‘I was worried and thinking of you!’ Shun said, ‘The various ministers of mine—help me to direct them.’ But surely Shun did not fail to understand that Xiang planned to murder him?” Mengzi said, “How could he not understand? But when Xiang was anxious, he was also anxious; when Xiang was happy, he was also happy.” Wan Zhang asked, “In that case, did Shun feign happiness?” Mengzi said, “No. Formerly, someone made a gift of a live fish to Zichan of the state of Zheng. Zichan had the pond keeper take care of it in the pond. But the pond keeper cooked it, and reported back to Zichan, ‘When I first let it go, it seemed sickly, but in a little while it perked up, and went off happily.’ Zichan said, ‘It’s where it should be! It’s where it should be!’ The pond keeper left and said, ‘Whoever said that Zichan was wise! I have already cooked and eaten it, and he says, “It’s where it should be! It’s where it should be!”’ Hence, gentlemen can be tricked by what is in accordance with their practices, but it is hard to ensnare them with what is not the Way. Xiang came in accordance with the Way of one who loves his elder brother. Hence, Shun genuinely trusted him and was happy about him. How could he have feigned it?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "5A9", "text": "Wan Zhang asked, “Someone said that the sage Boli Xi sold himself to a herder in the state of Qin for five ram skins, and fed cattle, because he sought to meet Duke Mu of Qin. Is this story trustworthy?” Mengzi said, “It is not. That is not the case. This was fabricated by those obsessed with taking office. Boli Xi was a person of the state of Yu. The people of the state of Jin, in exchange for jade from Chui Ji and a team of horses from Qu, gained rite of passage through Yu to attack the state of Guo. Qi of Gong remonstrated against this, but Boli Xi did not remonstrate against it. He knew that the Duke of Yu could not be remonstrated with, so he left and went to Qin. He was already seventy years old. If he did not yet know that it would be base to feed oxen in order to seek to meet Duke Mu of Qin, could he have been called wise? He knew that the Duke of Yu could not be remonstrated with so he did not northeast part of Pinglu county in modern Shanxi Province. Pinglu county in modern Shanxi Province. CHAPTER FOUR remonstrate with him. Can this be called unwise? He knew that the Duke of Yu was about to perish, so he abandoned him first. This cannot be called unwise. When he was, in good time, raised to prominence in Qin, he knew that Duke Mu was someone with whom he could work, so he became his minister. Can this be called unwise? He was a minister in Qin and made his ruler distinguished throughout the world, so that he is an example for later ages. Is this something he would be capable of if he were not a worthy person? To sell oneself so as to accomplish things for one’s lord—even a villager who cared for himself would not do this. Can one say that a worthy person would do it?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A1", "text": "Gaozi said, “Human nature is like a willow tree; righteousness is like cups and bowls. To make human nature benevolent and righteous is like making a willow tree into cups and bowls.” Mengzi said, “Can you, sir, following the nature of the willow tree, make it into cups and bowls? You must violate and rob the willow tree, and only then can you make it into cups and bowls. If you must violate and rob the willow tree in order to make it into cups and bowls, must you also violate and rob people in order to make them benevolent and righteous? If there is something that leads people to regard benevolence and righteousness as misfortunes for them, it will surely be your doctrine, will it not?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A2", "text": "Gaozi said, “Human nature is like swirling water. Make an opening for it on the eastern side, then it flows east. Make an opening for it on the western side, then it flows west. Human nature’s not distinguishing between good and not good is like water’s not distinguishing between eastern and western.” Mengzi said, “Water surely does not distinguish between east and west. But does it not distinguish between upward and downward? Human nature’s being good is like water’s tending downward. There is no human who does not tend toward goodness. There is no water that does not tend downward. “Now, by striking water and making it leap up, you can cause it to go past your forehead. If you guide it by damming it, you can cause it to remain on a mountaintop. But is this the nature of water?! It is that way because of the circumstances. That humans can be caused to not be good is due to their natures also being like this.” in 6A below that the desires for food and sex are nature) with Xunzi’s comments in Xunzi chapter 1, “An Exhortation to Learning” and Xunzi chapter 2, “Human Nature Is Bad” (in this volume, chapter 9).MENGZI (MENCIUS)"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A3", "text": "Gaozi said, “Life is what is meant by ‘nature.’” Mengzi said, “Is life is what is meant by ‘nature’ the same as white is what is meant by ‘white’?” Gaozi said, “It is.” Mengzi said, “Is the white of a white feather the same as the white of white snow, and is the white of white snow the same as the white of white jade?” Gaozi said, “It is.” Mengzi said, “Then is the nature of a dog the same as the nature of an ox, and is the nature of an ox the same as the nature of a human?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A4", "text": "Gaozi said, “The desires for food and sex are nature. Benevolence is internal; it is not external. Righteousness is external; it is not internal.” Mengzi said, “Why do you say that benevolence is internal and righteousness is external?” Gaozi said, “They are elderly, and we treat them as elderly. It is not that they are elderly because of us. Similarly, that is white, and we treat it as white, according to its being white externally to us. Hence, I say it is external.” Mengzi said, “[Elderliness] is different from whiteness. The whiteness of a [white] horse is no different from the whiteness of a gray-haired person. But surely we do not regard the elderliness of an old horse as being no different from the elderliness of an old person? Furthermore, do you say that the one who is elderly is righteous, or that the one who treats another as elderly is righteous?” Gaozi said, “My younger brother I love; the younger brother of a person from Qin I do not love. In this case, it is I who feel happy [because of my love for my brother]. Hence, I say that it is internal. I treat as elderly an elderly person from Chu, and I also treat as elderly my own elderly. In this case, it is the elderly person who feels happy. Hence, I say that it is external.” animals perceive and move.” The Han dynasty commentator Zhao Qi suggests that Gaozi’s comment means that, “In general, things that are the same in being alive will all have the same nature.” less of the context of its occurrence. See Angus C. Graham, Disputers of the Tao (La Salle, IL: Open Court Press, 1), 1–, and also chapter 5 of this volume. Mengzi or Gaozi’s view, almost worthless. benevolence is internal; respect is determined by elderliness, hence righteousness is external.” CHAPTER FOUR Mengzi said, “Savoring the roast of a person from Qin is no different from savoring my roast. So, what you describe is also the case with objects. Is savoring a roast, then, also external?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A5", "text": "Meng Jizi asked Gongduzi, “Why do you say that righteousness is internal?” Gongduzi said, “I act out of my respect, hence I say that it is internal.” Meng Jizi said, “If a fellow villager is older than your eldest brother by a year, then whom do you respect?” Gongduzi said, “I respect my brother.” Meng Jizi said, “When you are pouring wine, then whom do you serve first?” Gongduzi said, “I first pour wine for the fellow villager.” Meng Jizi said, “The one whom you respect is the former, but the one whom you treat as elder is the latter. Hence, it really is external. It does not come from [how you feel] internally.” Gongduzi was not able to answer. He told Mengzi about it. Mengzi said, “Next time, ask him, ‘Do you respect your uncle? or do you respect your younger brother?’ He will say, ‘I respect my uncle.’ Then you say, ‘When your younger brother is playing the part of the deceased in the sacrifice, then whom do you respect?’ He will say, ‘I respect my younger brother.’ Then you say, ‘What happened to the respect for your uncle?’ He will say, ‘The reason [why my respect changes] has to do with the role my younger brother occupies.’ Then you also say, ‘In the case you asked about in our previous discussion, the reason why my respect changes has to do with the role the fellow villager occupies. Ordinary respect is directed toward my brother, but temporary respect is directed toward the fellow villager.’” Meng Jizi, upon hearing all this, said, “If you respect your uncle, then it is respect. If you respect your younger brother, then it is respect. So, it really is external. It does not come from [how you feel] internally.” Gongduzi said, “On a winter day, one drinks broth. On a summer day, one drinks water. Are drinking and eating also, then, external?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A6", "text": "Gongduzi said, “Gaozi says, ‘Human nature is neither good nor not good.’ Some say, ‘Human nature can become good, and it can become not good.’ Therefore, when the sages Wen and Wu arose, the people were fond of goodness. When the tyrants You and Li arose, the people were fond of destructiveness. Some say, ‘There are natures that are good, and there are natures that are not good.’ Therefore, with Yao as ruler, there was Xiang. With the Blind Man as a father, there was  Shun. And with Tyrant Zhou as their nephew, and as their ruler besides, there were Viscount Qi of Wei and Prince Bi Gan. Now, you say that human nature is good. Are all those others, then, wrong?” Mengzi said, “As for their essence, they can become good. This is what I mean by calling their natures good. As for their becoming not good, this is not the fault of their potential. Humans all have the heart of compassion. Humans all have the heart of disdain. Humans all have the heart of respect. Humans all have the heart of approval and disapproval. The heart of compassion is benevolence. The heart of disdain is righteousness. The heart of respect is propriety. The heart of approval and disapproval is wisdom. Benevolence, righteousness, propriety, and wisdom are not welded to us externally. We inherently have them. It is simply that we do not reflect upon them. Hence, it is said, ‘Seek it and you will get it. Abandon it and you will lose it.’ Some differ from others by two, five, or countless times—this is because they cannot exhaust their potentials. The Odes say, Heaven gives birth to the teeming people. If there is a thing, there is a norm. This is the constant people cleave to. They are fond of this beautiful Virtue. Kongzi said, ‘The one who composed this ode understood the Way!’ Hence, if there is a thing, there must be a norm. It is this that is the constant people cleave to. Hence, they are fond of this beautiful Virtue.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A7", "text": "Mengzi said, “In years of plenty, most young men are gentle; in years of poverty, most young men are cruel. It is not that the potential that Heaven confers on them varies like this. They are like this because of that by which their hearts are sunk and drowned. “Consider barley. Sow the seeds and cover them. The soil is the same and the time of planting is also the same. They grow rapidly, and by the time of the summer “Blind Man.” See under Important Figures in the appendices for other people mentioned in this passage. Mengzi 1A. For more on yì 義, “righteousness,” see Mengzi 6A. For more on zhì 智, “wisdom,” see Mengzi A. For more on sī 思, “reflection” or “concentration,” see Mengzi 6A. For all four terms, also consult the appropriate entries under Important Terms in the appendices. On Mengzi’s general view of self-cultivation, see Mengzi 7A and 7B. solstice they have all ripened. Although there are some differences, these are due to the richness of the soil, and to unevenness in the rain and in human effort. Hence, in general, things of the same kind are all similar. Why would one have any doubt about this when it comes to humans alone? We and the sage are of the same kind. Hence, Longzi said, ‘When one makes a shoe for a foot one has not seen, we know that one will not make a basket.’ The similarity of all the shoes in the world is due to the fact that the feet of the world are the same. “Mouths have the same preferences in flavors. The master chef Yi Ya was the first to discover that which our mouths prefer. If it were the case that the natures of mouths regarding flavors varied among people—just as dogs and horses are different species from us—then why is it that throughout the world all preferences follow Yi Ya in flavors? The fact that, when it comes to flavors, the whole world looks to Yi Ya is due to the fact that mouths throughout the world are similar. “Ears are like this too. When it comes to sounds, the whole world looks to music master Shi Kuang. This is due to the fact that ears throughout the world are similar. Eyes are like this too. When it comes to a handsome man like Zidu, no one in the world does not appreciate his beauty. Anyone who does not appreciate the beauty of Zidu has no eyes. Hence, I say that mouths have the same preferences in flavors, ears have the same preferences in sounds, eyes have the same preferences in attractiveness. When it comes to hearts, are they alone without preferences in common? “What is it that hearts prefer in common? I say that it is fine patterns and righteousness. The sages first discovered what our hearts prefer in common. Hence, fine patterns and righteousness delight our hearts like meat delights our mouths.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A8", "text": "Mengzi said, “The trees of Ox Mountain were once beautiful. But because it bordered on a large state, hatchets and axes besieged it. Could it remain verdant? Due to the rest it got during the day or night, and the moisture of rain and dew, it was not that there were no sprouts or shoots growing there. But oxen and sheep then came and grazed on them. Hence, it was as if it were barren. People, seeing it barren, believed that there had never been any timber there. Could this be the nature of the mountain?! “When we consider what is present in people, could they truly lack the hearts of benevolence and righteousness?! That by which they discard their good heart is simply like the hatchets and axes in relation to the trees. With them besieging it day by day, can it remain beautiful? With the rest it gets during the day or night, and the restorative effects of the morning qi, their likes and dislikes are sometimes close to those of others. But then what they do during the day again fetters and néng 良能, “best capability,” mentioned in Mengzi 7A.MENGZI (MENCIUS)  destroys it. If the fettering is repeated, then the evening qi is insufficient to preserve it. If the evening qi is insufficient to preserve it, then one is not far from a bird or beast. Others see that he is a bird or beast, and think that there was never any capacity there. Is this what a human truly is?! “Hence, if it merely gets nourishment, there is nothing that will not grow. If it merely loses its nourishment, there is nothing that will not vanish. Kongzi said, ‘Grasped then preserved; abandoned then lost. Its goings and comings have no fixed time. No one knows its home.’ Was it not the heart of which he spoke?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A10", "text": "Mengzi said, “Fish is something I desire; bear’s paw is also something I desire. If I cannot have both, I will forsake fish and select bear’s paw. Life is something I desire; righteousness is also something I desire. If I cannot have both, I will forsake life and select righteousness. Life is something I desire, but there is something I desire more than life. Hence, I will not do just anything to obtain it. Death is something I hate, but there is something I hate more than death. Hence, there are calamities I do not avoid. If it were the case that someone desired nothing more than life, then what means that could obtain life would that person not use? If it were the case that someone hated nothing more than death, then what would that person not do that would avoid calamity? From this we can see that there are means of obtaining life that one will not employ. From this we can also see that there are things that would avoid calamity that one will not do. Therefore, there are things one desires more than life and there are also things one hates more than death. It is not the case that only the worthy person has this heart. All humans have it. The worthy person simply never loses it. “A basket of food and a bowl of soup—if one gets them then one will live; if one doesn’t get them then one will die. But if they’re given with contempt, then even a homeless person will not accept them. If they’re trampled upon, then even a beggar won’t take them. However, when it comes to a salary of ten thousand bushels of grain, then one doesn’t notice propriety and righteousness and accepts them. What do ten thousand bushels add to me? Do I accept them for the sake of a beautiful mansion? for the obedience of a wife and concubines? to have poor acquaintances be indebted to me? In the previous case, for the sake of one’s own life one did not accept what was offered. In the current case, for the sake of a beautiful mansion one does it. In the previous case, for the sake of one’s own life one did not accept what was offered. In the current case, for the obedience of a wife and concubine one does it. In the previous case, for the sake of one’s own life one did not (in chapter 9 of this volume). CHAPTER FOUR accept what was offered. In the current case, in order to have poor acquaintances be indebted to oneself one does it. Is this indeed something that one can’t stop doing? This is what is called losing one’s fundamental heart.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Six", "reference": "6A12", "text": "Mengzi said, “Suppose someone has a ring finger that is bent and will not straighten, and it is not the case that it hurts or that it interferes with one’s activities. But if there is something that can straighten it, one will not consider the road from one end of the world to the other too far, because one’s finger is not as good as other people’s. If one’s finger is not as good as other people’s, one knows to dislike it. But if one’s heart is not as good as other people’s, one does not know to dislike it. This is what is called not appreciating the categories of importance.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "6A15", "text": "Gongduzi asked, “We are the same in being humans. Yet some become great humans and some become petty humans. Why?” Mengzi said, “Those who follow their greater part become great humans. Those who follow their petty part become petty humans.” Gongduzi said, “We are the same in being humans. Why is it that some follow their greater part and some follow their petty part?” Mengzi said, “It is not the office of the ears and eyes to reflect, and they are misled by things. Things interact with things and simply lead them along. But the office of the heart is to reflect. If it reflects, then it will get [Virtue]. If it does not reflect, then it will not get it. This is what Heaven has given us. If one first takes one’s stand on what is greater, then what is lesser will not be able to snatch it away. This is how to become a great human.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A1", "text": "Mengzi said, “To fully apply one’s heart is to understand one’s nature. If one understands one’s nature, then one understands Heaven. To preserve one’s mind and nourish one’s nature is the means to serve Heaven. To not become conflicted over the length of one’s life, and to cultivate oneself to await it, is the means to stand and await one’s fate.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A2", "text": "Mengzi said, “Everything is fate. But one only accepts one’s proper fate. For this reason, someone who understands fate does not stand beneath a crumbling  wall. To die through fully following the Way is one’s proper fate. To die as a criminal is not one’s proper fate.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A3", "text": "Mengzi said, “‘If one seeks it, one will get it; if one abandons it, one will lose it.’ In this case, seeking helps in getting, because the seeking is in oneself. ‘There is a way to seek it, and getting it depends on fate.’ In this case, seeking does not help in getting, because the seeking is external.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A4", "text": "Mengzi said, “The ten thousand things are all brought to completion by us. To turn toward oneself and discover Sincerity—there is no greater delight than this. To firmly act out of sympathetic understanding—there is nothing closer to benevolence than this.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A7", "text": "Mengzi said, “A sense of shame is indeed important for people! Those who are crafty in their contrivances and schemes have no use for shame. If one is not ashamed of not being as good as others, how will one ever be as good as others?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A15", "text": "Mengzi said, “That which people are capable of without studying is their best capability. That which they know without pondering is their best knowledge. “Among babes in arms there is none that does not know to love its parents. When they grow older, there is none that does not know to respect its elder brother. Treating one’s parents as parents is benevolence. Respecting one’s elders is righteousness. There is nothing else to do but extend these to the world.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A17", "text": "Mengzi said, “Do not do that which you would not do; do not desire that which you would not desire. Simply be like this.” priety, and wisdom are all things that my nature has. . . . ‘Is external’ means that riches, honor, profit, and success are all external things.” the sentence means, “The ten thousand things are all complete within us.” chapter 1 of this volume) on “sympathetic understanding.” inherently” (cf. Mengzi 2A and 6A)."}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A26", "text": "Mengzi said, “Yang Zhu favored being ‘for ourselves.’ If plucking out one hair from his body would have benefited the whole world, he would not do it. Mozi favored ‘impartial caring.’ If scraping himself bare from head to heels would benefit the whole world, he would do it. Zimo held to the middle. Holding to the middle is close to it. But if one holds to the middle without discretion, that is the same as holding to one extreme. What I dislike about those who hold to one extreme is that they detract from the Way. They elevate one thing and leave aside a hundred others.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A27", "text": "Mengzi said, “Those who are starving find their food delicious; those who are parched find their drink delicious. They have no standard for food and drink because their hunger and thirst injure it. Is it only the mouth and belly that hunger and thirst injure?! Human hearts too are subject to injury. If one can prevent the injury of hunger and thirst from being an injury to one’s heart, then there will be no concern about not being as good as other people.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A35", "text": "Tao Ying asked, “When Shun was Son of Heaven, and Gao Yao was his Minister of Crime, if ‘the Blind Man’ had murdered someone, what would they have done?” Mengzi said, “Gao Yao would simply have arrested him!” Tao Ying asked, “So, Shun would not have forbidden it?” Mengzi said, “How could Shun have forbidden it? Gao Yao had a sanction for his actions.” Tao Ying asked, “So, what would Shun have done?” Mengzi said, “Shun looked at casting aside the whole world like casting aside a worn sandal. He would have secretly carried him on his back and fled, to live in the coastland, happy to the end of his days, joyfully forgetting the world.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A39", "text": "King Xuan of Qi wanted to shorten the period of mourning. Gongsun Chou said, “Isn’t mourning for a year better than stopping completely?” Mengzi said, “This is like if someone were twisting his elder brother’s arm, and you simply said to him, ‘How about doing it more gently?’ Simply instruct him in filial piety and brotherly respect.” Mengzi 3B and “Robber Zhi” (in chapter 3 of this volume). We know nothing about Zimo beyond what this passage tells us. father, the “Blind Man,” see Mengzi 5A.MENGZI (MENCIUS)  One of the imperial sons had a mother who died. His tutor asked on his behalf to let him mourn for a few months. Gongsun Chou said, “How about this case?” Mengzi said, “In this case, he desires to mourn the full period but he cannot. Even doing it one extra day would be better than stopping completely. What I had been talking about before was a case in which he did not do it, even though nothing prevented it.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7A45", "text": "Mengzi said, “Gentlemen, in relation to animals, are sparing of them, but are not benevolent toward them. In relation to the people, they are benevolent toward them, but do not treat them as kin. They treat their kin as kin, and then are benevolent toward the people. They are benevolent toward the people, and then are sparing of animals.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B3", "text": "Mengzi said, “It would be better to not have the History than to completely believe it. I accept only two or three passages in the ‘Completion of the War’ chapter. A benevolent person has no enemies in the world. When the one who was supremely benevolent [King Wu] attacked the one who was supremely unbenevolent [Tyrant Zhou], how could the blood have flowed till it floated the grain-pounding sticks?”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B5", "text": "Mengzi said, “A carpenter or a wheelwright can give another his compass or T-square, but he cannot make another skillful.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B11", "text": "Mengzi said, “If one is fond of making a name for oneself, one may be able to relinquish a state that can field a thousand chariots. But if one is just not that kind of person, relinquishing a basket of rice or a bowl of soup would show in one’s face.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B16", "text": "Mengzi said, “Benevolence is being a human. To bring them into harmony and put it into words is the Way.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B24", "text": "Mengzi said, “The mouth in relation to flavors, the eyes in relation to sights, the ears in relation to tones, the nose in relation to odors, the four limbs in relation to comfort—these are matters of human nature, but they are mandated. primary wife opposed letting him mourn for the full three-year period. On the three-year mourning period, see Analects 1. (in chapter 1 of this volume). A gentleman does not refer to them as ‘human nature.’ Benevolence in relation to father and son, righteousness in relation to ruler and minister, propriety in relation to guest and host, wisdom in relation to value, the sage in relation to the Way of Heaven—these are mandated, but they involve human nature. A gentleman does not refer to them as ‘mandated.’”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B31", "text": "Mengzi said, “People all have things that they will not bear. To extend this reaction to that which they will bear is benevolence. People all have things that they will not do. To extend this reaction to that which they will do is righteousness. If people can fill out the heart that does not desire to harm others, their benevolence will be inexhaustible. If people can fill out the heart that will not trespass, their righteousness will be inexhaustible. If people can fill out the core reaction of not accepting being addressed disrespectfully, there will be nowhere they go where they do not do what is righteous. If a scholar may not speak and speaks, this is flattering by speaking. If one should speak but does not speak, this is flattering by not speaking. These are both in the category of trespassing.”"}
{"philosopher": "Mencius", "work": "Mencius", "book": "Seven", "reference": "7B37", "text": "Wan Zhang asked, “When in the state of Chen, Kongzi said, ‘Perhaps I should return home. The scholars of my school are wild and hasty, advancing and grasping, but do not forget their early behavior.’ When in Chen, why did Kongzi think of the wild scholars of his home state of Lu?” Mengzi said, “Kongzi said, ‘If I do not get to associate with those who attain the Way, then must it not be those who are wild or squeamish? Those who are wild advance and grasp. Those who are squeamish have some things that they will not do.’ Did Kongzi not want those who attained the Way?! He could not be sure of getting them. Hence, he thought of the next best.” Wan Zhang said, “I venture to ask what one must be like, such that one can be called ‘wild.’” Mengzi said, “Those like Qin Zhang, Zengxi, and Mu Pi are the ones Kongzi called ‘wild.’” Wan Zhang said, “Why did he call them ‘wild’?” Mengzi said, “Their resolutions were grand. They said, ‘The ancients! The ancients!’ But if one calmly examines their conduct, it does not match their and revealing anecdote involving Zengxi in Analects 1. (in chapter 1 of this volume).MENGZI (MENCIUS)  resolutions and words. If he also failed to get those who are wild, he desired to get to associate with those who disdain to do what is not pure. These are the squeamish. They are the next best. “Kongzi said, ‘The only ones who pass by my door without entering my home whom I do not regret getting as associates are the village worthies. The village worthies are the thieves of virtue.’” Wan Zhang said, “What must one be like, such that one can be called a ‘village worthy’?” Mengzi said, “The village worthies are those who say, Why are [the resolutions of the wild scholars] so grand? Their words take no notice of their actions, and their actions take no notice of their words. Then they say, ‘The ancients! The ancients!’ And why are the actions [of the squeamish] so solitary and aloof? Born in this era, we should be for this era. To be good is enough. Eunuch-like, pandering to their eras—these are the village worthies.” Wan Zhang said, “If the whole village declares them worthy people, there is nowhere they will go where they will not be worthy people. Why did Kongzi regard them as thieves of virtue?” Mengzi said, “If you try to condemn them, there is nothing you can point to; if you try to censure them, there is nothing to censure. They are in agreement with the current customs; they are in harmony with the sordid era in which they live. That in which they dwell seems to be loyalty and trustworthiness; that which they do seems to be blameless and pure. The multitude delight in them; they regard themselves as right. But you cannot enter into the Way of Yao and Shun with them. Hence, Kongzi said they are ‘thieves of virtue.’ “Kongzi said, ‘I hate that which seems but is not. I hate weeds out of fear that they will be confused with seedlings. I hate cleverness out of fear that it will be confused with righteousness. I hate glibness out of fear that it will be confused with trustworthiness. I hate the tunes of the state of Zheng out of fear that they will be confused with genuine music. I hate purple out of fear that it will be confused with vermilion. I hate the village worthies, out of fear that they will be confused with those who have Virtue.’ “The gentleman simply returns to the standard. If the standard is correct, then the multitudinous people will be inspired. When the people are inspired, then there will be no evil or wickedness.” pare also the use of “sprouts” in Mengzi 2A."}
